app/controllers/api/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "jose"], ["last_name", "perez"], ["created_at", "2018-03-10 12:25:38.080090"], ["updated_at", "2018-03-10 12:25:38.080090"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "jjj"], ["last_name", "kkkk"], ["updated_at", "2018-03-10 12:30:23.137835"], ["id", 5]]